Data/TestFiles/cases/DamBreak3D/case/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{

    open
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.1;
        value           $internalField;
    }

    wall
    {
        type        omegaWallFunction;
        value       $internalField;
    }

    defaultFaces
    {
        type        omegaWallFunction;
        value       $internalField;
    }


    redistributeHelper
    {
        #include "include/helperPatchFieldType";
        value $internalField;
    }
}

// ************************************************************************* //
