Data/TestFiles/cases/DamBreak3D/case/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
);

regions
(

    cellToCell
    {
        set "Box002";
        fieldValues
        (
            volScalarFieldValue alpha.water 1.0
        );
    }

    cellToFace
    {
        set "Box002";
        option all;
        fieldValues
        (
            volScalarFieldValue alpha.water 1.0
        );
    }
);

// ************************************************************************* //

